DmitriyKalashnikov1/STM32Projects/PID_Controller_Inverter_TPA/Inverter_TPA/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"
#include "stm32g4xx_nucleo.h"
#include "stdio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_HRTIM_MspPostInit(HRTIM_HandleTypeDef *hhrtim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RCC_OSC32_IN_Pin GPIO_PIN_14
#define RCC_OSC32_IN_GPIO_Port GPIOC
#define RCC_OSC32_OUT_Pin GPIO_PIN_15
#define RCC_OSC32_OUT_GPIO_Port GPIOC
#define RCC_OSC_IN_Pin GPIO_PIN_0
#define RCC_OSC_IN_GPIO_Port GPIOF
#define RCC_OSC_OUT_Pin GPIO_PIN_1
#define RCC_OSC_OUT_GPIO_Port GPIOF
#define CURRENT_IN_Pin GPIO_PIN_0
#define CURRENT_IN_GPIO_Port GPIOA
#define VOLTAGE_IN_Pin GPIO_PIN_1
#define VOLTAGE_IN_GPIO_Port GPIOA
#define NRF_SS_Pin GPIO_PIN_4
#define NRF_SS_GPIO_Port GPIOA
#define NRF_SCK_Pin GPIO_PIN_5
#define NRF_SCK_GPIO_Port GPIOA
#define NRF_MISO_Pin GPIO_PIN_6
#define NRF_MISO_GPIO_Port GPIOA
#define NRF_MOSI_Pin GPIO_PIN_7
#define NRF_MOSI_GPIO_Port GPIOA
#define NRF_CSN_Pin GPIO_PIN_4
#define NRF_CSN_GPIO_Port GPIOC
#define NRF_IRQ_Pin GPIO_PIN_2
#define NRF_IRQ_GPIO_Port GPIOB
#define NRF_IRQ_EXTI_IRQn EXTI2_IRQn
#define GERCON_IN_Pin GPIO_PIN_11
#define GERCON_IN_GPIO_Port GPIOB
#define BUTTON_STOP_Pin GPIO_PIN_12
#define BUTTON_STOP_GPIO_Port GPIOB
#define LED_MCU_ON_Pin GPIO_PIN_13
#define LED_MCU_ON_GPIO_Port GPIOB
#define LED_MCU_ERROR_Pin GPIO_PIN_14
#define LED_MCU_ERROR_GPIO_Port GPIOB
#define LED_MCU_STATE_Pin GPIO_PIN_15
#define LED_MCU_STATE_GPIO_Port GPIOB
#define T_SWDIO_Pin GPIO_PIN_13
#define T_SWDIO_GPIO_Port GPIOA
#define T_SWCLK_Pin GPIO_PIN_14
#define T_SWCLK_GPIO_Port GPIOA
#define T_SWO_Pin GPIO_PIN_3
#define T_SWO_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

typedef enum PID_Param {
	Output_Current, Input_Power,
} PID_Param_e;

typedef struct PID {
	float Kp;
	float Ki;
	float Kd;
} PID_t;


void arrayShift(volatile uint32_t *arr, int arraySize, int elementSize);
void Filter();
void HRTIM_Stop(void);
void HRTIM_Start(void);
void HRTIM_Set(uint32_t period, uint32_t shift);
void pingCopter();
void PID_Control(PID_Param_e param, PID_t *coeffs);
void NRF24_Init(void);
void Change_Shift(void);
void StopButtonSignal(void);
void StationOverCurrentSignal(void);
void StationOverVoltageSignal(void);
void StationOverPowerSignal(void);
void CopterOutOfRangeCurrentSignal(void);
void CopterOutOfRangeVoltageSignal(void);
void CopterOutOfRangePowerSignal(void);
void ChargeSignal();
void ChargedSignal();
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
